Repository: liuzeyi11/GovernmentWorkReportCorpus
Catalog: government_report_tmx_file/GR2022.tmx
Source language: en_us
Languages: zh_cn

source: REPORT ON THE WORK OF THE GOVERNMENT
zh_cn: 政府工作报告

source: Delivered at the Fifth Session of the 13th National People's Congress of the People's Republic of China on March 5, 2022
zh_cn: ——2022年3月5日在第十三届全国人民代表大会第五次会议上

source: Li Keqiang, Premier of the State Council
zh_cn: 国务院总理 李克强

source: Fellow Deputies,
zh_cn: 各位代表：

source: On behalf of the State Council, I will now report to you on the work of the government and ask for your deliberation and approval. I also ask members of the National Committee of the Chinese People's Political Consultative Conference (CPPCC) for their comments.
zh_cn: 现在，我代表国务院，向大会报告政府工作，请予审议，并请全国政协委员提出意见。

source: I. A Review of Our Work in 2021
zh_cn: 一、2021年工作回顾

source: Last year was a milestone in the history of the Communist Party of China (CPC) and our country.
zh_cn: 过去一年是党和国家历史上具有里程碑意义的一年。

source: The CPC Central Committee with Comrade Xi Jinping at its core united and led the whole Party and Chinese people of all ethnic groups in accomplishing the following endeavors: We celebrated the centenary of the Communist Party of China;
zh_cn: 以习近平同志为核心的党中央团结带领全党全国各族人民，隆重庆祝中国共产党成立一百周年，

source: The 19th CPC Central Committee convened its sixth plenary session where a resolution on the Party's major achievements and historical experience over the past century was adopted;
zh_cn: 胜利召开党的十九届六中全会、制定党的第三个历史决议，

source: We declared victory in the critical battle against poverty as envisaged; and
zh_cn: 如期打赢脱贫攻坚战，

source: We achieved the first centenary goal of building a moderately prosperous society in all respects on schedule and began a new journey toward the second centenary goal of building a modern socialist country in all respects.
zh_cn: 如期全面建成小康社会、实现第一个百年奋斗目标，开启全面建设社会主义现代化国家、向第二个百年奋斗目标进军新征程。

source: Last year, facing complicated and challenging circumstances both in and outside of China, as well as many risks and challenges, all of us throughout the country worked hard as one.
zh_cn: 一年来，面对复杂严峻的国内外形势和诸多风险挑战，全国上下共同努力，

source: We responded to Covid-19 and pursued economic and social development in a well-coordinated way, accomplished the main targets and tasks for the year, got the 14th Five-Year Plan off to a good start, and once again secured new and major achievements in our country's development.
zh_cn: 统筹疫情防控和经济社会发展，全年主要目标任务较好完成，“十四五”实现良好开局，我国发展又取得新的重大成就。

source: —The economy continued to recover and grow.
zh_cn: ——经济保持恢复发展。

source: China's gross domestic product (GDP) reached 114 trillion yuan, growing 8.1 percent.
zh_cn: 国内生产总值达到114万亿元，增长8.1%。

source: National fiscal revenue exceeded 20 trillion yuan, growing 10.7 percent.
zh_cn: 全国财政收入突破20万亿元，增长10.7%。

source: A total of 12.69 million urban jobs were added, and the average surveyed unemployment rate stood at 5.1 percent.
zh_cn: 城镇新增就业1269万人，城镇调查失业率平均为5.1%。

source: The consumer price index (CPI) rose by 0.9 percent.
zh_cn: 居民消费价格上涨0.9%。

source: A basic equilibrium was maintained in the balance of payments.
zh_cn: 国际收支基本平衡。

source: —China's innovation capacity was strengthened.
zh_cn: ——创新能力进一步增强。

source: Our strategic science and technology capabilities were expanded at a faster pace.
zh_cn: 国家战略科技力量加快壮大。

source: Major advances were registered in research on core technologies in key fields, and breakthroughs were made in manned spaceflight, Mars exploration, resource exploration, energy projects and other areas.
zh_cn: 关键核心技术攻关取得重要进展，载人航天、火星探测、资源勘探、能源工程等领域实现新突破。

source: Corporate spending on research and development grew by 15.5 percent.
zh_cn: 企业研发经费增长15.5%。

source: Integration of digital technology in the real economy was accelerated.
zh_cn: 数字技术与实体经济加速融合。

source: —The economic structure and regional development priorities were refined.
zh_cn: ——经济结构和区域布局继续优化。

source: Grain output reached a record high of 685 million metric tons.
zh_cn: 粮食产量1.37万亿斤，创历史新高。

source: Value-added of the high-tech manufacturing sector grew by 18.2 percent, IT services and other producer services recorded rapid growth, and industrial chains became more resilient.
zh_cn: 高技术制造业增加值增长18.2%，信息技术服务等生产性服务业较快发展，产业链韧性得到提升。

source: Regional development strategies were well implemented, and new urbanization was steadily advanced.
zh_cn: 区域发展战略有效实施，新型城镇化扎实推进。

source: —Reform and opening up were deepened.
zh_cn: ——改革开放不断深化。

source: In key fields and sectors, a full range of major reforms were rolled out, and supply-side structural reform was deepened.
zh_cn: 在重要领域和关键环节推出一批重大改革举措，供给侧结构性改革深入推进。

source: New gains were made in the reform to streamline administration and delegate power, improve regulation, and upgrade services.
zh_cn: “放管服”改革取得新进展。

source: The total number of market entities surpassed the 150-million mark.
zh_cn: 市场主体总量超过1.5亿户。

source: The Belt and Road Initiative saw steady high-quality development.
zh_cn: 高质量共建“一带一路”稳步推进。

source: China worked for the entry into force of the Regional Comprehensive Economic Partnership Agreement.
zh_cn: 推动区域全面经济伙伴关系协定生效实施。

source: The total volume of trade in goods grew by 21.4 percent, and growth of utilized foreign investment was sustained.
zh_cn: 货物进出口总额增长21.4%，实际使用外资保持增长。

source: —Ecological conservation was enhanced.
zh_cn: ——生态文明建设持续推进。

source: Thanks to further steps taken to prevent and control pollution, the discharge of major pollutants continued to fall and the average concentration of fine particulate matter (PM2.5) dropped by 9.1 percent in cities at and above the prefecture level.
zh_cn: 污染防治攻坚战深入开展，主要污染物排放量继续下降，地级及以上城市细颗粒物（PM2.5）平均浓度下降9.1%。

source: The first group of national parks were officially established.
zh_cn: 第一批国家公园正式设立。

source: Significant improvements were made in the quality of the environment.
zh_cn: 生态环境质量明显改善。

source: —Living standards rose steadily.
zh_cn: ——人民生活水平稳步提高。

source: Per capita disposable income increased by 8.1 percent in real terms.
zh_cn: 居民人均可支配收入实际增长8.1%。

source: Achievements in poverty alleviation were consolidated and further expanded.
zh_cn: 脱贫攻坚成果得到巩固和拓展。

source: Inputs in basic elderly care, basic medical care, and social assistance were increased.
zh_cn: 基本养老、基本医疗、社会救助等保障力度加大。

source: New steps were taken in the reform and development of education.
zh_cn: 教育改革发展迈出新步伐。

source: Renovations began on 56,000 old urban residential communities, benefiting close to 10 million households.
zh_cn: 新开工改造城镇老旧小区5.6万个，惠及近千万家庭。

source: —Our gains in Covid-19 response were consolidated.
zh_cn: ——疫情防控成果持续巩固。

source: Implementation of control measures became routine, and over 85 percent of the population received a full course of vaccination.
zh_cn: 落实常态化防控举措，疫苗全程接种覆盖率超过85%，

source: Local outbreaks were suppressed in an effective and quick manner.
zh_cn: 及时有效处置局部地区聚集性疫情，

source: By making these efforts, we ensured the health and safety of the people and maintained normal order in work and life.
zh_cn: 保障了人民生命安全和身体健康，维护了正常生产生活秩序。

source: Reflecting on the past year, we can see that our achievements did not come easily.
zh_cn: 回顾过去一年，成绩得来殊为不易。

source: While the economy continued to recover from major shocks including Covid-19, many new changes occurred in and outside of China, and the difficulty of keeping the economy running stably mounted.
zh_cn: 我国经济尚处在突发疫情等严重冲击后的恢复发展过程中，国内外形势又出现很多新变化，保持经济平稳运行难度加大。

source: In the face of such difficulty, we fully implemented the decisions and plans of the Party Central Committee with Comrade Xi Jinping at its core,
zh_cn: 我们深入贯彻以习近平同志为核心的党中央决策部署，

source: followed the guiding principles of the Central Economic Work Conference;
zh_cn: 贯彻落实中央经济工作会议精神，

source: applied the new development philosophy in full, in the right way, and in all fields of endeavor;
zh_cn: 完整、准确、全面贯彻新发展理念，

source: took solid steps to ensure stability on six key fronts and security in six key areas,
zh_cn: 扎实做好“六稳”、“六保”工作，

source: and made cross- and counter-cyclical adjustments with macro policies. We thus effectively dealt with all risks and challenges that arose.Our main work over the past year was as follows.
zh_cn: 注重宏观政策跨周期和逆周期调节，有效应对各种风险挑战，主要做了以下工作。

source: 1. We kept macro policy consistent and targeted and kept the major economic indicators within the appropriate range.
zh_cn: 一是保持宏观政策连续性针对性，推动经济运行保持在合理区间。

source: Our macro policies facilitated cross-cyclical adjustments and sustained the level of support necessary for economic recovery. We also took into account the need to leave ample policy space for meeting difficulties and challenges this year.
zh_cn: 宏观政策适应跨周期调节需要，保持对经济恢复必要支持力度，同时考虑为今年应对困难挑战预留政策空间。

source: We established a regular mechanism to directly allocate budgetary funds to prefecture- and county-level governments and placed 2.8 trillion yuan of central government funding under this mechanism.
zh_cn: 建立常态化财政资金直达机制，将2.8万亿元中央财政资金纳入直达范围。

source: We also improved the way local governments issue and use special-purpose bonds.
zh_cn: 优化地方政府专项债券发行使用。

source: We implemented a prudent monetary policy to good effect and lowered required reserve ratios twice to facilitate the reduction of loan interest rates.
zh_cn: 有效实施稳健的货币政策，两次全面降准，推动降低贷款利率。

source: We took well-considered steps to defuse local government debt risks and dealt prudently with major financial risks.
zh_cn: 有序推进地方政府债务风险防范化解，稳妥处置重大金融风险事件。

source: We intensified policies to stabilize and expand employment, took solid measures to ensure employment for key groups like college graduates, and encouraged business startups and innovation.
zh_cn: 强化稳岗扩就业政策落实，扎实做好高校毕业生等重点群体就业工作，推进大众创业万众创新。

source: We took stronger steps to keep supply and prices of major commodities stable and to tackle supply shortages in coal and electric power.
zh_cn: 加强大宗商品保供稳价，着力解决煤炭电力供应紧张问题。

source: Over the course of last year, all major macroeconomic indicators stayed in line with projected targets, the deficit-to-GDP ratio and macro leverage ratio decreased, and China's economy remained one of the fastest-growing economies in the world.
zh_cn: 从全年看，主要宏观经济指标符合预期，财政赤字率和宏观杠杆率下降，经济增速继续位居世界前列。

source: 2. We refined and implemented policies for easing the difficulties of businesses and consolidated the foundation of economic recovery.
zh_cn: 二是优化和落实助企纾困政策，巩固经济恢复基础。

source: As over one hundred million market entities have given several hundred million people the opportunity to go into business or secure employment, we have continued with the supportive macro-policy roadmaps and approaches that have proved effective since the epidemic began.
zh_cn: 上亿市场主体承载着数亿人就业创业，宏观政策延续疫情发生以来行之有效的支持路径和做法。

source: Tax and fee reductions introduced last year totaled more than one trillion yuan. In addition, tax payments were postponed for micro, small and medium enterprises (MSMEs) in manufacturing as well as coal-fired power plants and heating-supply enterprises as a temporary measure.
zh_cn: 去年新增减税降费超过1万亿元，还对制造业中小微企业、煤电和供热企业实施阶段性缓缴税费。

source: Tax and fee reductions have proved a direct and effective way of helping enterprises ease their difficulties. In reality, they also help nurture business growth and cultivate sources of tax revenue. Last year, revenue generated from taxpaying market entities registered since 2013 reached 4.76 trillion yuan.
zh_cn: 实践表明，减税降费是助企纾困直接有效的办法，实际上也是“放水养鱼”、涵养税源，2013年以来新增的涉税市场主体去年纳税达到4.76万亿元。

source: We strengthened the capacity of railway, highway, aviation and maritime transportation as well as harbors.
zh_cn: 加强铁路、公路、航空、海运、港口等运输保障。

source: We boosted the credit supply to industries and enterprises severely affected by Covid-19. We continued policies for micro and small businesses to defer principal and interest repayments on loans and take out more collateral-free loans.
zh_cn: 加大对受疫情影响严重行业企业信贷投放，继续执行小微企业贷款延期还本付息和信用贷款支持政策，银行业金融机构普惠小微企业贷款增长27.

source: Inclusive finance lending to micro and small business by financial institutions increased by 27.3 percent, with the figure rising to over 40 percent for large commercial banks, and overall financing costs of businesses dropped steadily.
zh_cn: 3%，大型商业银行普惠小微企业贷款增幅超过40%，企业综合融资成本稳中有降。

source: We deepened reform, expanded opening up, and continued to improve the business environment.
zh_cn: 三是深化改革扩大开放，持续改善营商环境。

source: We worked harder to develop the underlying institutions for a market system, and pushed forward reforms to ensure production factors are allocated by the market.
zh_cn: 加强市场体系基础制度建设，推进要素市场化配置等改革。

source: We continued to reduce the number of procedures and length of time it takes for enterprises to gain government approval. More government services were made available online.
zh_cn: 继续压减涉企审批手续和办理时限，更多政务服务事项实现一网通办。

source: A package of successful practices in local reform were applied nationwide, and trials were conducted to improve the business environment.
zh_cn: 推广一批地方改革经验，开展营商环境创新试点。

source: We bolstered regulation and adopted new regulatory approaches, took action against business monopolies, and prevented the unregulated expansion of capital, thus ensuring fair market competition.
zh_cn: 加强和创新监管，反垄断和防止资本无序扩张，维护公平竞争。

source: We continued implementation of the three-year action plan for SOE reform and supported the healthy development of private businesses.
zh_cn: 深入实施国企改革三年行动。支持民营企业健康发展。

source: The reform to delink industry associations and chambers of commerce from government was basically completed.
zh_cn: 基本完成行业协会商会与行政机关脱钩改革。

source: The Beijing Stock Exchange and Guangzhou Futures Exchange were opened.
zh_cn: 设立北京证券交易所和广州期货交易所。

source: Solid strides were made in reforms in agriculture, rural development, social programs, and ecological conservation.
zh_cn: 稳步推进农业农村、社会事业、生态文明等领域改革。

source: We deepened practical cooperation to jointly advance the Belt and Road Initiative.
zh_cn: 深化共建“一带一路”务实合作。

source: Efforts to ensure stable performance in foreign trade and investment were intensified.
zh_cn: 加大稳外贸稳外资力度，

source: We successfully hosted a number of major expos, including the China International Import Expo, the China Import and Export Fair, the China International Fair for Trade in Services, and the first China International Consumer Products Expo.
zh_cn: 成功举办进博会、广交会、服贸会及首届消博会等重大展会。

source: Comprehensive trials for further opening up of the services sector were expanded to four more areas, and new measures for developing the Hainan Free Trade Port were adopted.
zh_cn: 新增4个服务业扩大开放综合试点，推出海南自由贸易港开放新举措。

source: 4. We promoted innovation-driven development and stabilized industrial and supply chains.
zh_cn: 四是强化创新引领，稳定产业链供应链。

source: We boosted the development of national laboratories and promoted implementation of major science and technology programs.
zh_cn: 加强国家实验室建设，推进重大科技项目实施。

source: We reformed and refined the management of central government funding for scientific and technological research, increased the proportion of indirect expenses for research projects, and gave institutes more decision-making power over their research.
zh_cn: 改革完善中央财政科研经费管理，提高间接费用比例，扩大科研自主权。

source: We continued the additional tax deduction for R&D expenses and increased this deduction to cover 100 percent of such expenses for manufacturing enterprises.
zh_cn: 延续实施研发费用加计扣除政策，将制造业企业研发费用加计扣除比例提高到100%。

source: Intellectual property right protection was strengthened.
zh_cn: 强化知识产权保护。

source: Weak links in the industrial chains of key industries were reinforced and upgraded.
zh_cn: 开展重点产业强链补链行动。

source: Digital and smart technologies were adopted in traditional industries at a faster rate, and emerging industries maintained good momentum for development.
zh_cn: 传统产业数字化智能化改造加快，新兴产业保持良好发展势头。

source: 5. We promoted coordinated development between urban and rural areas and between regions and improved the structure of the economy.
zh_cn: 五是推动城乡区域协调发展，不断优化经济布局。

source: To ensure implementation of all major regional development strategies and the strategy for coordinated regional development, we rolled out new supporting measures and launched several major projects.
zh_cn: 落实区域重大战略和区域协调发展战略，出台新的支持举措，实施一批重大项目。

source: Urbanization with the focus on county seats was promoted.
zh_cn: 推进以县城为重要载体的城镇化建设。

source: To help bolster agricultural production, we ensured agricultural supplies and issued one-time subsidies totaling 20 billion yuan to grain growers.
zh_cn: 加强农业生产，保障农资供应，对种粮农民一次性发放200亿元补贴。

source: We advanced rural revitalization and designated 160 key counties to receive assistance in pursuing rural revitalization.
zh_cn: 推动乡村振兴，确定160个国家乡村振兴重点帮扶县。

source: A five-year program to improve the rural living environment also got under way.
zh_cn: 实施农村人居环境整治提升五年行动。

source: 6. We strengthened environmental protection and promoted sustainable development.
zh_cn: 六是加强生态环境保护，促进可持续发展。

source: We consolidated our gains in keeping the skies blue, waters clear, and land pollution-free.
zh_cn: 巩固蓝天、碧水、净土保卫战成果。

source: We encouraged farmers to use chemical fertilizer and pesticide more efficiently and promoted the recycling of livestock and poultry waste.
zh_cn: 推动化肥农药减量增效和畜禽养殖废弃物资源化利用。

source: We continued major projects to protect and restore ecosystems, and fully enforced the ten-year fishing ban on the Yangtze River.
zh_cn: 持续推进生态保护修复重大工程，全面实施长江十年禁渔。

source: China's installed capacity of renewable power exceeded one billion kilowatts.
zh_cn: 可再生能源发电装机规模突破10亿千瓦。

source: An action plan for peaking carbon emissions by 2030 was unveiled.
zh_cn: 出台碳达峰行动方案。

source: The China Carbon Emission Trade Exchange was launched.
zh_cn: 启动全国碳排放权交易市场。

source: We took active steps to respond to climate change.
zh_cn: 积极应对气候变化。

source: 7. We worked to ensure and improve the people's wellbeing and accelerated development of social programs.
zh_cn: 七是着力保障和改善民生，加快发展社会事业。

source: We intensified efforts to shore up weak links in rural compulsory education, and increased subsidies in the nutrition improvement program for compulsory-education students in rural areas, benefiting over 37 million students.
zh_cn: 加大农村义务教育薄弱环节建设力度，提高学生营养改善计划补助标准，3700多万学生受益。

source: We reduced the homework load and eased the off-campus tutoring burden on students in compulsory education.
zh_cn: 减轻义务教育阶段学生作业负担和校外培训负担。

source: We surpassed the targets set in the three-year enrollment expansion initiative for vocational colleges.
zh_cn: 超额完成高职扩招三年行动目标。

source: The cap for government-subsidized student loans was raised by 4,000 yuan per person per year, benefiting over five million students.
zh_cn: 国家助学贷款每人每年最高额度增加4000元，惠及500多万在校生。

source: The basic pension for retirees was increased.
zh_cn: 上调退休人员基本养老金。

source: Benefits were raised for entitled groups.
zh_cn: 提高优抚标准。

source: To improve assistance and support for those in need, the scope of the subsistence allowance scheme was expanded to include people with serious illness or severe disability from families just outside the margin of eligibility.
zh_cn: 将低保边缘家庭重病重残人员纳入低保范围，做好困难群众帮扶救助。

source: We reformed the system for disease prevention and control.
zh_cn: 改革疾病预防控制体系。

source: Outpatient bills for more common illnesses and chronic diseases became reimbursable under the basic medical insurance scheme, and 60 percent of cross-provincial inpatient medical expenses were directly settled where they were incurred.
zh_cn: 把更多常见病、慢性病等门诊费用纳入医保报销范围，住院费用跨省直接结算率达到60%。

source: We tightened up regulation and supervision of drugs and vaccines.
zh_cn: 严格药品疫苗监管。

source: The three-child policy was implemented.
zh_cn: 实施三孩生育政策。

source: Elderly services were improved.
zh_cn: 加强养老服务。

source: Government-subsidized rental housing was increased at a faster pace.
zh_cn: 加快发展保障性租赁住房。

source: We developed cultural programs and the cultural sector, and launched new cultural projects to benefit the public.
zh_cn: 繁荣发展文化事业和文化产业，创新实施文化惠民工程。

source: A sound online environment was fostered.
zh_cn: 营造良好网络生态。

source: We actively carried out public fitness activities.
zh_cn: 积极开展全民健身运动。

source: Chinese athletes achieved great success in the Olympic and Paralympic Games in Tokyo.
zh_cn: 我国体育健儿在东京奥运会、残奥会上勇创佳绩。

source: And thanks to meticulous preparation, China has presented the world with a simple, safe, and splendid 2022 Winter Olympic Games. The Paralympic Games, which has just opened, will undoubtedly also be a great success.
zh_cn: 经过精心筹备，我们成功举办了简约、安全、精彩的北京冬奥会，也一定能办好刚刚开幕的冬残奥会。

source: 8. We made progress in building a rule of law government, developed new ways of conducting governance, and maintained social harmony and stability.
zh_cn: 八是推进法治政府建设和治理创新，保持社会和谐稳定。

source: We submitted 10 legislative proposals to the Standing Committee of the National People's Congress (NPC) for deliberation, and formulated or revised 15 sets of administrative regulations.
zh_cn: 提请全国人大常委会审议法律议案10件，制定修订行政法规15部。

source: We conscientiously handled the proposals of NPC deputies and CPPCC National Committee members.
zh_cn: 认真办理人大代表建议和政协委员提案。

source: The Outline for Building a Law-Based Government (2021–2025) was promulgated.
zh_cn: 出台法治政府建设实施纲要。

source: Audit-based oversight was enhanced.
zh_cn: 发挥审计监督作用。

source: The State Council continued its accountability inspections, and further implemented the Internet plus model of inspection.
zh_cn: 继续开展国务院大督查，深入实施“互联网+督查”。

source: New approaches were adopted in conducting primary-level governance in urban and rural areas.
zh_cn: 创新城乡基层治理。

source: We made solid headway in handling public complaints and clearing the backlog of cases.
zh_cn: 扎实做好信访工作，化解信访积案。

source: We took stronger steps to ensure workplace safety and strengthened emergency response management.
zh_cn: 强化安全生产和应急管理。

source: Our ability to safeguard national security was enhanced.
zh_cn: 加强国家安全保障能力建设。

source: We improved the crime prevention and control system, worked to crack down on organized crime and root out local criminal gangs on an ongoing basis, and fought telecom and cyber fraud as a priority.
zh_cn: 完善社会治安防控体系，常态化开展扫黑除恶斗争，集中打击治理电信网络诈骗等犯罪。

source: During severe flooding and other disasters that hit some parts of the country last year, government authorities and departments were actively involved in disaster prevention, relief, and reconstruction and earnestly strived to protect people's lives and property.
zh_cn: 去年一些地区发生严重洪涝等灾害，各方面积极开展防灾救灾和灾后重建，努力保障人民群众生命财产安全。

source: We implemented the Party Central Committee's strategic decision to exercise full and strict Party self-governance.
zh_cn: 贯彻落实党中央全面从严治党战略部署。

source: We carried out activities to study the history of the CPC, and did more to improve Party conduct, build a government of integrity, and fight corruption.
zh_cn: 开展党史学习教育。加强党风廉政建设和反腐败斗争。

source: We strictly complied with the central Party leadership's eight-point decision on improving work conduct, kept up our efforts to tackle pointless formalities, bureaucratism, hedonism and extravagance, and took further steps to ease the burdens of those working on the ground.
zh_cn: 严格落实中央八项规定精神，持之以恒纠治“四风”，进一步为基层减负。

source: We advanced China's major-country diplomacy on all fronts.
zh_cn: 中国特色大国外交全面推进。

source: President Xi Jinping and other Party and state leaders attended, via video link, major diplomatic events, including the 76th UN General Assembly, the 16th G20 Leaders' Summit, the 28th APEC Economic Leaders' Meeting, the 13th BRICS Summit, the Special Summit to Commemorate the 30th Anniversary of China-ASEAN Dialogue Relations, the opening ceremony of the Eighth Ministerial Conference of the Forum on China-Africa Cooperation, the East Asia leaders' meetings on cooperation and the 13th Asia-Europe Meeting.
zh_cn: 习近平主席等党和国家领导人通过视频方式出席联合国大会、二十国集团领导人峰会、亚太经合组织领导人非正式会议、金砖国家领导人会晤、中国－东盟建立对话关系30周年纪念峰会、中非合作论坛部长级会议开幕式、东亚合作领导人系列会议、亚欧首脑会议等重大活动。

source: We also successfully hosted a number of major diplomatic events.
zh_cn: 成功举办多场重大主场外交活动。
